<template>
	<div>
		<h1>企业能耗比对比图</h1>
		<ve-line :data="chartData"></ve-line>
		<h1>企业作业量对比图(单位：万吨)</h1>
		<ve-histogram :data="chartData2"></ve-histogram>
	</div>
</template>

<script>
	export default {
		name:'',
		data() {
			return {
				chartData: {
				  columns: ['月份', '周口港', '漯河港', '日照港'],
				  rows: [
					{ '月份': '1月', '周口港': 15, '漯河港': 18, '日照港': 12 },
					{ '月份': '2月', '周口港': 23, '漯河港': 22, '日照港': 13 },
					{ '月份': '3月', '周口港': 26, '漯河港': 27, '日照港': 15 },
					{ '月份': '4月', '周口港': 18, '漯河港': 29, '日照港': 14 },
					{ '月份': '5月', '周口港': 20, '漯河港': 30, '日照港': 19 },
					{ '月份': '6月', '周口港': 28, '漯河港': 32, '日照港': 20 },
					{ '月份': '7月', '周口港': 33, '漯河港': 34, '日照港': 22 },
					{ '月份': '8月', '周口港': 36, '漯河港': 36, '日照港': 24 }
					
				  ]
				},
				chartData2: {
				  columns: ['月份', '周口港', '漯河港', '日照港'],
				  rows: [
					{ '月份': '1月', '周口港': 15, '漯河港': 18, '日照港': 12 },
					{ '月份': '2月', '周口港': 23, '漯河港': 22, '日照港': 13 },
					{ '月份': '3月', '周口港': 26, '漯河港': 27, '日照港': 15 },
					{ '月份': '4月', '周口港': 18, '漯河港': 29, '日照港': 14 },
					{ '月份': '5月', '周口港': 20, '漯河港': 30, '日照港': 19 },
					{ '月份': '6月', '周口港': 28, '漯河港': 32, '日照港': 20 },
					{ '月份': '7月', '周口港': 33, '漯河港': 34, '日照港': 22 },
					{ '月份': '8月', '周口港': 36, '漯河港': 36, '日照港': 24 }
					
				  ]
				}
			};
		},
		methods:{
			
		}
		
	}
</script>

<style>
h1{
	text-align: center;
}
</style>
